models/Article.php

   public function saveImage($filename)
   {

    $this->image = $filename;

    return $this->save(false);
---
UPDATE `article` SET `image`='805665916e215a1b0a9d376bbf620983.jpg' WHERE `id`=2